# функция input существует для того, чтобы в момент испрлнения кода пользователь мог ввести данные с клавиатуры. Внутри скобок функции input можно написать текст, который будет выведен на экран перед тем, как пользователь введет данные. Данные, которые ввел пользователь, будут возвращены функцией input в виде строки (тип данных str).
#title_book = str(input("Напишите название вашей любиой книги: "))
#print(title_book, type(title_book))

# Приммер использования переменных в консоли (не очень удобный)
#greeting = "Добрый день,"
#user_name = "Вениамин"
#profession = "NLM"
#print(greeting, user_name,"," " на сегодняшний день ваша профессия", profession)

# Пример использования f-string
#user = 'Veniamin'
#greeting =f"Добрый вечер, {user}, время продуктивно поработать!"
#print(greeting)

# Управляющие символы в строках
# \n — переход на новую строку;
# \t — табуляция;
# \r — возврат каретки в начало строки;
# \b — возврат каретки на один символ.

# Сложение (конкатенация строк)
#print("Фамилия" + " " + "Имя" + " " + "Отчество")

# Целые и вещественные числа
# a = 2 - целое число
# b = 2.0 - вещественное число (Число с плавающей точкой)

# Преобразование типов
# int() — преобразует строку (или вещественное число) в целое число. Дополнительно можно указать, в какой системе счисления было записано исходное число. По умолчанию используется десятичная система. При конвертации вещественного числа в целое отбрасывается дробная часть;
#float() — преобразует строку (или целое число) в вещественное число;
# str() — преобразует значения (в общем случае не только числовые) в строки.

# Округление
# Пример: квадратный корень из 99 до 4 знаков после запятой
#print(f"{99**0.5:.4f}")

# Доп операции
# целочисленное деление — x // y;
# остаток от деления — x % y.
#print(11 // 4) = 2
#print(11 % 4) = 3

# Итак, предлагаем приступить к практике! Начнём с задачи, которая поможет вам закрепить 
# навык работы с базовым синтаксисом Python для вывода текста.
# Начнём с простого. Напишите программу, которая выведет текст: Привет, Яндекс!.
print("Привет, Яндекс!")

# Отлично! Двигаемся дальше. Предлагаем решить следующую задачу, которая поможет вам 
# научиться работать с функцией input() для ввода данных и форматирования строк для вывода результата.
# Для этого напишите диалоговую программу, которая сначала спросит имя пользователя, 
# а затем поприветствует его.
print("Как Вас зовут?")
user_name = input()
print(f"Привет, {user_name}")

# Вы знаете два главных принципа программистов?
# «Повторение — мать учения!» и «Если это можно автоматизировать — автоматизируй!»
# Что будет, если их объединить?
# Вы создадите программу, которая принимает одну строку и выводит её трижды, каждая строка 
# на новой строке.
print((input() + "\n") * 3)

# Возьмём простую задачу из школьной математики. Покупатель купил 2.5 кг черешни по цене 38 руб/кг.
# Сколько сдачи он получит? Вычислите стоимость покупки, а затем найдите разность 
# между номиналом купюры и этой стоимостью.
has = int(input())
cost = 2.5 * 38
change = has - cost
print(int(change))

# Теперь надо определить, какую сдачу нужно выдать покупателю за покупку товара. 
# Стоимость покупки вычисляется как произведение цены на вес товара.
product_price = int(input())
weight = int(input())
cash = int(input())
print(cash - (product_price * weight))

# Напишите программу, которая рассчитывает стоимость покупки и печатает чек в 
# заданном формате. Гарантируется, что у покупателя достаточно денег для покупки.
name = str(input())
price = int(input())
weight = int(input())
result = int(price * weight)
cash = int(input())
change = cash - (price * weight)
print(f"Чек \n{name} - {weight}кг - {price}руб/кг \nИтого: {result}руб \nВнесено: {cash}руб \nСдача: {change}руб")

# Напишите программу, которая N раз выводит строку «Купи слона!».
count_elephant = int(input())
text = "Купи слона!\n"
print(text * count_elephant)

# Напишите программу, которая выводит N строк наказания. Каждая строка должна содержать 
# текст в указанном формате, включающий часть наказания, введённую пользователем
punishment_count = int(input())
punishment_part = input()
punishment = f'Я больше никогда не буду писать "{punishment_part}"!\n'
print(punishment * punishment_count, end='')

# В детском саду 2 ребенка вместе съедают 2 куска колбасы за 2 минуты.
# Напишите программу, которая вычисляет, сколько кусков колбасы съедят N детей за M минут.
N = int(input())
M = int(input())
print(N * M // 2)

# Напишите программу, которая формирует карточку для личного дела ребёнка. Карточка 
# создаётся на основе имени ребёнка и трёхзначного номера шкафчика, который содержит:
# Первую цифру — номер группы. Вторую цифру — номер кроватки. Третью цифру — порядковый
# номер ребёнка в списке группы.
name = input()
number = int(input())
child_list = number % 10
group = number // 100 % 10
box = number // 10 % 10
print(f"Группа №{group}.\n{child_list}. {name}.\nШкафчик: {number}.\nКроватка: {box}.")

# Напишите программу для робота-няни, которая из числа вида abcd составляет число badc.
number = int(input())
a = number // 1000
b = number // 100 % 10
c = number // 10 % 10
d = number % 10
print(f"{b}{a}{d}{c}")

# Напишите программу, которая складывает два числа поразрядно без учёта переносов. 
# Каждая пара цифр суммируется независимо, и результат записывается в соответствующий разряд.
int_1 = int(input())
int_2 = int(input())

cou_1_1 = int_1 % 10
cou_2_1 = int_1 // 10 % 10
cou_3_1 = int_1 // 100

cou_1_2 = int_2 % 10
cou_2_2 = int_2 // 10 % 10
cou_3_2 = int_2 // 100

res1 = (cou_1_1 + cou_1_2) % 10
res2 = (cou_2_1 + cou_2_2) % 10
res3 = (cou_3_1 + cou_3_2) % 10

print(res3 * 100 + res2 * 10 + res1)

#Напишите программу для робоняни, которая поможет раздать конфеты детям на новогоднем утреннике.
# Конфеты должны быть разделены поровну между всеми детьми, а оставшиеся конфеты 
# останутся у Деда Мороза.
N = int(input())
M = int(input())
candies_for_children = M // N
candies_for_cead_morose = M - candies_for_children * N
print(f"{candies_for_children}\n{candies_for_cead_morose}")

# В группе детского сада проводится игра с шариками трёх цветов: красного, зелёного и синего. 
# Каждый ребёнок по очереди вытаскивает один шарик из ящика. Победителем становится тот, 
# кто первым вытащит зелёный шарик. Напишите программу, которая определяет максимальное 
# количество ходов, которое потребуется, чтобы найти зелёный шарик.
red = int(input())
green = int(input())
blue = int(input())
print(red + blue + 1)

# Сегодня в N часов M минут владелец магазина заказал доставку нового товара.
# Оператор сообщил, что продукты доставят через T минут.
# Сколько будет времени на электронных часах, когда привезут долгожданные продукты?
N = int(input())
M = int(input())
T = int(input())
minutes = N * 60 + M + T
total_hourse = (minutes // 60) % 24
total_min = minutes % 60
print(f"{total_hourse:02d}:{total_min:02d}")

# Продуктовый склад и магазин находятся на одной дороге города Н.
# Склад находится на отметке A км, а магазин — B км. Средняя скорость автомобиля, доставляющего 
# товары, C км/ч.За какое время продукты попадают со склада в магазин?
A = int(input())
B = int(input())
C = int(input())
distance = B - A
abs_distance = abs(distance)
print(round(abs_distance / C, 2))

# Напишите программу, которая поможет магазину посчитать общую сумму выручки, учитывая, 
# что кассовый аппарат выдаёт сумму последней покупки в двоичной системе счисления.
all_buys = int(input())
last_buy = input()
last_buy_10 = int(last_buy, 2)
print(all_buys + last_buy_10)

# А пока как насчет того, чтобы научиться конвертировать числа из двоичной в десятичную систему?
# Продолжаем работать с задачей. Кстати, несмотря на ошибку аппарата, сдачу тоже нужно отдавать
coast_buy = input()
money_take = int(input())
coast_buy_10 = int(coast_buy, 2)
print(money_take - coast_buy_10)

# Давайте приведём в порядок чек, который печатали ранее.
# Все строки должны быть длиной в 35 символов.
# Напишите программу, которая выводит красиво оформленный чек. Все строки в чеке должны быть 
# длиной ровно 35 символов, текст выровнен в соответствии с примером.
name = input()
price = int(input())
weight = int(input())
result = int(price * weight)
cash = int(input())
change = cash - (price * weight)
print(f"{'Чек':=^35}")
print(f"{'Товар:':<15}{name:>20}")
print(f"{'Цена:':<10}{f'{weight}кг * {price}руб/кг':>25}")
print(f"{'Итого:':<10}{f'{result}руб':>25}")
print(f"{'Внесено:':<10}{f'{cash}руб':>25}")
print(f"{'Сдача:':<10}{f'{change}руб':>25}")
print(f"{'':=^35}")

# Помогите ему разобраться с одной проблемой. Далее его история: «Пару дней назад я 
# купил две партии котлет и по случайности высыпал их на один прилавок. Общий вес котлет составил 
# N килограмм, а ценник — M рублей за килограмм.
# Сегодня я обнаружил, что накладные на эти виды котлет потерялись, но я помню, 
# что первый вид котлет стоил 
# K1 рублей за килограмм, а второй — K2. Помогите мне вспомнить вес каждой партии 
# котлет, чтобы поставить их на учёт.
N = int(input())
M = int(input())
K1 = int(input())
K2 = int(input())
y = (N * (M - K1)) / (K2 - K1)
x = N - y
print(int(x), int(y))