# функция input существует для того, чтобы в момент испрлнения кода пользователь мог ввести данные с клавиатуры. Внутри скобок функции input можно написать текст, который будет выведен на экран перед тем, как пользователь введет данные. Данные, которые ввел пользователь, будут возвращены функцией input в виде строки (тип данных str).
#title_book = str(input("Напишите название вашей любиой книги: "))
#print(title_book, type(title_book))

# Приммер использования переменных в консоли (не очень удобный)
#greeting = "Добрый день,"
#user_name = "Вениамин"
#profession = "NLM"
#print(greeting, user_name,"," " на сегодняшний день ваша профессия", profession)

# Пример использования f-string
#user = 'Veniamin'
#greeting =f"Добрый вечер, {user}, время продуктивно поработать!"
#print(greeting)

# Управляющие символы в строках
# \n — переход на новую строку;
# \t — табуляция;
# \r — возврат каретки в начало строки;
# \b — возврат каретки на один символ.

# Сложение (конкатенация строк)
#print("Фамилия" + " " + "Имя" + " " + "Отчество")

# Целые и вещественные числа
# a = 2 - целое число
# b = 2.0 - вещественное число (Число с плавающей точкой)

# Преобразование типов
# int() — преобразует строку (или вещественное число) в целое число. Дополнительно можно указать, в какой системе счисления было записано исходное число. По умолчанию используется десятичная система. При конвертации вещественного числа в целое отбрасывается дробная часть;
#float() — преобразует строку (или целое число) в вещественное число;
# str() — преобразует значения (в общем случае не только числовые) в строки.

# Округление
# Пример: квадратный корень из 99 до 4 знаков после запятой
#print(f"{99**0.5:.4f}")

# Доп операции
# целочисленное деление — x // y;
# остаток от деления — x % y.
#print(11 // 4) = 2
#print(11 % 4) = 3

number = str(input())
result = f"doc_{number}"
print(result)